MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_sdioc.c
/*!< Parameter valid check for SDIOC data transfer mode. */
#define IS_VALID_SDIOC_TRANSFER_MODE(x) \
    ((SdiocTransferSingle == (x)) ||    \
     (SdiocTransferInfinite == (x)) ||  \
     (SdiocTransferMultiple == (x)) ||  \
     (SdiocTransferStopMultiple == (x)))

/*!< Parameter valid check for SDIOC data timeout. */
#define IS_VALID_SDIOC_DATA_TIMEOUT(x) \
    ((SdiocDtoSdclk_2_13 == (x)) ||    \
     (SdiocDtoSdclk_2_14 == (x)) ||    \
     (SdiocDtoSdclk_2_15 == (x)) ||    \
     (SdiocDtoSdclk_2_16 == (x)) ||    \
     (SdiocDtoSdclk_2_17 == (x)) ||    \
     (SdiocDtoSdclk_2_18 == (x)) ||    \
     (SdiocDtoSdclk_2_19 == (x)) ||    \
     (SdiocDtoSdclk_2_20 == (x)) ||    \
     (SdiocDtoSdclk_2_21 == (x)) ||    \
     (SdiocDtoSdclk_2_22 == (x)) ||    \
     (SdiocDtoSdclk_2_23 == (x)) ||    \
     (SdiocDtoSdclk_2_24 == (x)) ||    \
     (SdiocDtoSdclk_2_25 == (x)) ||    \
     (SdiocDtoSdclk_2_26 == (x)) ||    \
     (SdiocDtoSdclk_2_27 == (x)))

/*!< Parameter valid check for SDIOC Response type name. */
#define IS_VALID_SDIOC_RESP_TYPE_NAME(x) \
    ((SdiocCmdRspR1 == (x)) ||           \
     (SdiocCmdRspR1b == (x)) ||          \
     (SdiocCmdRspR2 == (x)) ||           \
     (SdiocCmdRspR3 == (x)) ||           \
     (SdiocCmdRspR4 == (x)) ||           \
     (SdiocCmdRspR5 == (x)) ||           \
     (SdiocCmdRspR5b == (x)) ||          \
     (SdiocCmdRspR6 == (x)) ||           \
     (SdiocCmdRspR7 == (x)) ||           \
     (SdiocCmdNoRsp == (x)))

/*!< Parameter valid check for SDIOC data timeout. */
#define IS_VALID_SDIOC_HOST_STATUS(x)    \
    ((SdiocCmdPinLvl == (x)) ||          \
     (SdiocData0PinLvl == (x)) ||        \
     (SdiocData1PinLvl == (x)) ||        \
     (SdiocData2PinLvl == (x)) ||        \
     (SdiocData3PinLvl == (x)) ||        \
     (SdiocCardInserted == (x)) ||       \
     (SdiocDataLineActive == (x)) ||     \
     (SdiocCardStateStable == (x)) ||    \
     (SdiocBufferReadEnble == (x)) ||    \
     (SdiocBufferWriteEnble == (x)) ||   \
     (SdiocCardDetectPinLvl == (x)) ||   \
     (SdiocCommandInhibitCmd == (x)) ||  \
     (SdiocWriteProtectPinLvl == (x)) || \
     (SdiocCommandInhibitData == (x)) || \
     (SdiocReadTransferActive == (x)) || \
     (SdiocWriteTransferActive == (x)))

/*!< Parameter valid check for SDIOC normal interrupt. */
#define IS_VALID_SDIOC_NOR_INT(x)      \
    ((SdiocCardInt == (x)) ||          \
     (SdiocErrorInt == (x)) ||         \
     (SdiocCardRemoval == (x)) ||      \
     (SdiocBlockGapEvent == (x)) ||    \
     (SdiocCardInsertedInt == (x)) ||  \
     (SdiocCommandComplete == (x)) ||  \
     (SdiocBufferReadReady == (x)) ||  \
     (SdiocBufferWriteReady == (x)) || \
     (SdiocTransferComplete == (x)))

/*!< Parameter valid check for SDIOC error interrupt. */
#define IS_VALID_SDIOC_ERR_INT(x)   \
    ((SdiocCmdCrcErr == (x)) ||     \
     (SdiocDataCrcErr == (x)) ||    \
     (SdiocCmdIndexErr == (x)) ||   \
     (SdiocCmdEndBitErr == (x)) ||  \
     (SdiocAutoCmd12Err == (x)) ||  \
     (SdiocCmdTimeoutErr == (x)) || \
     (SdiocDataEndBitErr == (x)) || \
     (SdiocDataTimeoutErr == (x)))

/*!< Parameter valid check for SDIOC auto CMD12 error status. */
#define IS_VALID_SDIOC_AUTOCMD_ERR(x)    \
    ((SdiocCmdNotIssuedErr == (x)) ||    \
     (SdiocAutoCmd12CrcErr == (x)) ||    \
     (SdiocAutoCmd12Timeout == (x)) ||   \
     (SdiocAutoCmd12IndexErr == (x)) ||  \
     (SdiocAutoCmd12EndBitErr == (x)) || \
     (SdiocAutoCmd12NotExecuted == (x)))

/*!< Parameter valid check for SDIOC detect card signal. */
#define IS_VALID_SDIOC_DETECT_SIG(x) \
    ((SdiocSdcdPinLevel == (x)) ||   \
     (SdiocCardDetectTestLevel == (x)))

/*!< Parameter valid check for SDIOC data block count value. */
#define IS_VALID_SDIOC_BLKCNT(x) ((x) != 0u)

/*!< Parameter valid check for SDIOC data block size value. */
#define IS_VALID_SDIOC_BLKSIZE(x) (!((x)&0xF000ul))

/*!< Parameter valid check for SDIOC command value. */
#define IS_VALID_SDIOC_CMD_VAL(x) (!(0xC0u & (x)))

/*!< Parameter valid check for buffer address. */
#define IS_VALID_TRANSFER_BUF_ALIGN(x) (!((SDIOC_BUF_ALIGN_SIZE - 1ul) & ((uint32_t)(x))))

/*!< Parameter valid check for SDIOC command value. */
#define IS_VALID_TRANSFER_BUF_LEN(x) (!((SDIOC_BUF_ALIGN_SIZE - 1ul) & ((uint32_t)(x))))

/*!< SDIOC unit max count value. */
#define SDIOC_UNIT_MAX_CNT (ARRAY_SZ(m_astcSdiocInstanceDataLut))

/*!< SDIOC default sdclk frequency. */
#define SDIOC_SDCLK_400K (400000ul)

/*!< Get the specified register address of the specified SDIOC unit */
#define SDIOC_ARG01(__SDIOCx__) ((uint32_t)(&((__SDIOCx__)->ARG0)))
#define SDIOC_BUF01(__SDIOCx__) ((uint32_t)(&((__SDIOCx__)->BUF0)))
#define SDIOC_RESPx(__SDIOCx__, RESP_REG) ((uint32_t)(&((__SDIOCx__)->RESP0)) + (uint32_t)(RESP_REG))

/* SDIOC buffer align size */
#define SDIOC_BUF_ALIGN_SIZE (4ul)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static en_sdioc_clk_div_t SdiocGetClkDiv(uint32_t u32Exclk,
                                         uint32_t u32SdiocClkFreq);
static stc_sdioc_intern_data_t *SdiocGetInternDataPtr(const M4_SDIOC_TypeDef *SDIOCx);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief Get SDIOC clock division.
 **
 ** \param [in] u32Exclk                Exclk frequency
 ** \param [in] u32ClkFreq              SDIOC clock frequency
 **
 ** \retval SdiocClkDiv_1               EXCLK/1
 ** \retval SdiocClkDiv_2               EXCLK/2
 ** \retval SdiocClkDiv_4               EXCLK/4
 ** \retval SdiocClkDiv_8               EXCLK/8
 ** \retval SdiocClkDiv_16              EXCLK/16
 ** \retval SdiocClkDiv_32              EXCLK/32
 ** \retval SdiocClkDiv_64              EXCLK/64
 ** \retval SdiocClkDiv_128             EXCLK/128
 ** \retval SdiocClkDiv_256             EXCLK/256
 **
 ******************************************************************************/
static en_sdioc_clk_div_t SdiocGetClkDiv(uint32_t u32Exclk,
                                         uint32_t u32ClkFreq)
{
    uint32_t u32SdClkDiv = 0ul;
    en_sdioc_clk_div_t enClockDiv = SdiocClkDiv_256;

    if (0ul != u32ClkFreq)
    {
        u32SdClkDiv = u32Exclk / u32ClkFreq;
        if (u32Exclk % u32ClkFreq)
        {
            u32SdClkDiv++;
        }

